# Напишите программу, которая подсчитывает сколько аденина, гуанина, цитозина и тимина
s = input()
print("Аденин: ", s.count("А") + s.count("а"))
print("Гуанин: ", s.count("Г") + s.count("г"))
print("Цитозин: ", s.count("Ц") + s.count("ц"))
print("Тимин: ", s.count("Т") + s.count("т"))
